    def cafeteria(self):
        loc = self.locations["cafeteria"]
        print(f"\n{loc.visit()}")
        self.player.visited_locations.append("Столовая")
        while True:
            choice = input(
                "Чтобы успеть на экзамен, нужно обогнать очередь из студентов. Принимаете вызов? (да/нет): ").lower().strip()

            if choice == "да":
                print("\nЧтобы вас пропустили к поварихе, нужно будет обыграть других студентов.")
                self.student_game()  
                break
            elif choice == "нет":
                print("\nВы встали в конец очереди и опоздали на экзамен. Вас отчислили из-за матана. 💀")
                self.end_game() 
                break
            else:
                print("Пожалуйста, введите 'да' или 'нет'")
