    def exam_begin(self):
        print("\n Ирина Александровна: 'Подходите, тяните билеты!'")
        print("Вы тянете билет...")

        drawn_ticket = random.choice(self.exam_tickets)
        print(f"🎫 Вы вытянули билет №{drawn_ticket}")

        if drawn_ticket in self.player.prepared_tickets:
            print("🎉 УРА! Вы подготовились именно к этому билету!")

            bonus = 0
            if self.player.special_artifact("Калькулятор"):
                print("🧮 Калькулятор волшебный помогает решать сложные задачи!")
                bonus = 0.2  # 20% бонус к шансу хорошо ответить

            if random.random() < (0.7 + bonus):
                print("Вы хорошо ответили и получаете оценку 4!")
                reward = Artifact("Зачетка с четверкой", "", "Вы сдали экзамен на 4", 40)
            else:
                print("Вы ответили средне, но сдали. Оценка 3.")
                reward = Artifact("Зачетка с тройкой", "", "Вы сдали экзамен на 3", 30)

            self.player.add_artifact(reward)
            self.exam_success()  
        else:
            print("💀 Вы не готовы к этому билету! Удачи!!!")
            print("Нужно срочно что-то придумать...")
            self.cheat_choice()  # Переходим к выбору способа списывания
