    def teacher_quest(self):
        loc = self.locations["teacher_quest"]
        print(f"\n{loc.visit()}")
        self.player.visited_locations.append("Задание от препода")

        print(f"\n Преподаватель Ирина Александровна останавливает вас:")
        print(f"'Студент! Срочно отнеси эти документы в кабинет...'")
        print("Но в этот момент преподавателю позвонили по телефону, и вы не расслышали номер кабинета!")
        print("Ирина Александровна ушла, а вы стоите с документами в руках...")
        print(f"\nВозможные кабинеты: {', '.join(self.classrooms)}")
        print(f"У вас есть {self.teacher_attempts} попытки, чтобы угадать правильный кабинет!")

        attempts = self.teacher_attempts
        while attempts > 0:
            print(f"\n Попыток осталось: {attempts}")
            guess = input("Введите номер кабинета (501-506): ").strip()

            if guess == self.target_classroom:
                print(f"\n🎉 УРА! Вы правильно угадали кабинет {self.target_classroom}!")
                print("Вы успешно доставили документы и успеваете на экзамен! Препод поставил вам автомат за помощь")
                self.exam_result(True)  
                return
            else:
#
                attempts -= 1
                if attempts > 0:
                    print(f" Не угадали! Это не кабинет {guess}.")
                    if int(guess) < int(self.target_classroom):
                        print("💡 Подсказка: Нужный кабинет имеет БОЛЬШИЙ номер")
                    else:
                        print("💡 Подсказка: Нужный кабинет имеет МЕНЬШИЙ номер")
                else:
                    print(f"\n💀 К сожалению, попытки закончились!")
                    print(f"Правильный кабинет был: {self.target_classroom}")
                    print("Вы опоздали на экзамен, пока искали кабинет...")
                    self.exam_result(False)  
                    return

    def exam_result(self, on_time: bool):
        print("\n 💀Экзамен по матану:")

        if on_time:
            if random.random() < 0.8: 
                print("🎉 Вы успешно сдали экзамен! Поздравляем!")
                if random.random() < 0.5:
                    reward = Artifact("Благодарность препода - автомат по матану", "🏆",
                                      "Преподаватель доволен вашей помощью", 50)
                    self.player.add_artifact(reward)
                    print(f" За помощь преподаватель дал вам: {reward}")
            else:
                print("К сожалению, вы не успели подготовиться и не сдали. Вас отчислили из-за матана.")
        else:
            print("⏰ Вы опоздали на экзамен!")

        self.end_game()  # Завершаем игру
